from aiogram import Bot

WELCOME_TEXT = """👋 Добре дошъл в нашето крипто семейство!

Току-що направи една от най-важните крачки към своето финансово бъдеще — реши да се образоваш и свържеш с хора, които мислят като теб. 🚀
Тук си сред млади, амбициозни и подкрепящи се хора, с които заедно ще откривате света на криптовалутите и блокчейн технологиите — ясно, практично и без излишна сложност.

📚 Не забравяй да разгледаш закачените съобщения във всички чатове — там ще намериш важна информация, линкове и насоки.

💬 В нашата общност държим на уважението, добрия тон и смисления диалог.
❌ Без обиди, спам или подвеждащи съвети.
✅ Вместо това — подкрепа, споделен опит и много знания.

Добре дошъл още веднъж — радваме се, че си с нас! ❤️
"""

SCHEDULED_MESSAGES = {
    3: """✨ Всяка голяма общност започва с първите стъпки. Ти вече си част от нещо значимо!"""
 "Покани приятел...",
    21: "👀 А ти вече разказа ли на приятел за тази група?"
"🤝 Може би точно сега е най-подходящият момент...",
    150: "Здрасти!"
"""Вече сме заедно от 150 дни — страхотно, как лети времето! 📈...""",
    354: "⏳ Колко бързо минава времето — вече почти една година сме заедно...",
    361: "Остават само три дни — и знаеш ли, ще ни липсваш!"
"Искрено се надяваме, че отново ще се присъединиш. 💛",
}

def get_scheduled_message(days: int):
    return SCHEDULED_MESSAGES.get(days)

async def send_welcome_message(bot: Bot, chat_id: int, user_id: int):
    await bot.send_message(chat_id, WELCOME_TEXT)
